export const ruMessages = {

    aboutMe: {
        description: 
        `
            Я Front-end разработчик с желанием совершенствоваться, получать новые задачи, изучать новые технологии, применять новые подходы и стать разработчиком с опытом.
            Моя цель как Front-end разработчика - применять свои технические навыки, использовать свои знания, получать знания от других разработчиков и просто выполнять свою работу на 100%.
            Я стремлюсь принести успех компании, учиться и обучать других, разрабатывать ИТ-решения и решать проблемы!
        `,

        lang: {
            en: 'Английский',
            ru: 'Русский',
            ruLevel: 'Носитель'
        }
    },

    githubProductionCode: {
        why_empty: 'Почему пустой?',
        why_empty_answer: 'Потому что я скрыл все репозитории',
        whereProdCode: 'Где я могу увидеть production код?',
        corePath: `Мое написанное ядро, где вы можете найти код, который я написал для production'a`,
        iWroteMore: 'конечно, я писал больше кода',
        corePrompt: 'посмотрите на папку, где вы можете увидеть мой написанный код',
        readProdCode: 'вы можете увидеть production код',
        onlySnippet: 'это не лучший код, который я написал за все время, это всего лишь фрагмент кода.'
    },

    workExp: {
        linkedIn: 'LinkedIn доказательства + Рекомендовательно письмо'
    },

    otherProgramming: {
        article: 'Я часто пишу статьи про программирование и часто читаю другие',
        codeWars: 'Просто решаю задачи в CodeWars и совершенствую свое алгоритмическое мышление'
    },

    titles: {
        greeting: `Привет, меня зовут Ратмир`,
        techSkills: "Мои технические навыки",
        workExp: "Мой опыт работы",
        aboutMe: "Обо мне",
        hackathons: "Другое программирование и хакатоны",
        otherProgramming: 'Другое программирование (Medium & CodeWars)',
        contactWithMe: 'Напишите мне'
    },

    common: {
        my: 'Мой',
        in: 'В',
        thisRepository: 'этот репозиторий'
    },
}